##########################################################
############   万能提交脚本，拖过去就可以使用的   ############
##########################################################
############   需要禁用这个标识：#!/bin/bash    ############
############   否则颜色显示不出来了😂           ############
##########################################################


currentDir=$(cd "$(dirname "$0")"; pwd)
cd ${currentDir}

echo "\033[32m请输入提交信息(不要输入空格)：🙃🙃🙃🙃🙃\033[0m"
read commitInfo

echo "\033[32mgit 开始更新...🙃🙃🙃🙃🙃 \033[0m"

git add .
git commit -m $commitInfo
git push -u origin master

echo "\033[32mgit 推送完毕🙃🙃🙃🙃🙃\033[0m"
sleep 2
exit